
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 22-user 8-core network, expiring 30 Jun 2026
Serial number: 501909306443
  Licensed to: Kwon Giyoung
               Becker Friedman Institute

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do ./0_process_data_main.do 

. global data_dir = "/Users/giyoung/Downloads/inflation_replication/scripts/mas
> ter/data/raw"

. global output_dir = "/Users/giyoung/Downloads/inflation_replication/scripts/m
> aster/data/processed"

. 
. preserve 

. import delimited "$data_dir/onet_teleworkable_blscodes.csv", clear 
(encoding automatically selected: ISO-8859-1)
(3 vars, 764 obs)

. rename occ_code oes_occ_code 

. tempfile onet_temp

. save `onet_temp'
file /var/folders/3s/6hs2pd6547g54y2xmwf_2mdm0000gp/T//St24133.000002 saved
    as .dta format

. restore

. 
. use "$data_dir//atlFed_wage_data_15t24.dta", clear

. 
. 
. * wage group 
. gen wagegroup_num = real(regexs(1)) if regexm(wagegroup, "^([0-9]+)")

. 
. 
. * Create education group based on numeric codes
. gen str15 educ_group = ""
(197,801 missing values generated)

. replace educ_group = "Bachelors+" if inlist(educ92, 6, 7)
(82,595 real changes made)

. replace educ_group = "Less than Bachelors" if inlist(educ92, 1, 2, 3, 4, 5)
variable educ_group was str15 now str19
(115,206 real changes made)

. 
. 
. * Create a string variable to hold the label
. gen str occ_lbl = ""
(197,801 missing values generated)

. 
. * Loop through all unique values of occ and assign labels
. levelsof occ, local(occs)
10 20 40 50 51 52 60 100 101 102 110 120 135 136 137 140 150 160 220 230 300 31
> 0 330 335 340 350 360 410 420 425 430 440 500 510 520 530 540 565 600 630 640
>  650 700 705 710 725 726 735 740 750 800 810 820 830 840 845 850 860 900 910 
> 930 940 950 960 1005 1006 1007 1010 1020 1021 1022 1030 1031 1032 1050 1060 1
> 065 1105 1106 1107 1108 1200 1220 1240 1300 1305 1306 1310 1320 1340 1350 136
> 0 1400 1410 1420 1430 1440 1450 1460 1500 1510 1520 1530 1540 1541 1545 1550 
> 1551 1555 1560 1600 1610 1640 1650 1700 1710 1720 1740 1745 1750 1760 1800 18
> 20 1821 1822 1825 1840 1860 1900 1910 1920 1930 1935 1965 1970 1980 2000 2001
>  2002 2003 2004 2005 2006 2010 2011 2012 2013 2014 2015 2016 2025 2040 2050 2
> 060 2100 2105 2145 2160 2170 2180 2200 2205 2300 2310 2320 2330 2340 2350 236
> 0 2400 2430 2435 2440 2540 2545 2550 2555 2600 2630 2631 2632 2633 2634 2635 
> 2636 2640 2700 2710 2720 2721 2722 2723 2740 2750 2751 2752 2755 2760 2770 28
> 00 2805 2810 2825 2830 2840 2850 2860 2861 2862 2865 2900 2905 2910 2920 3000
>  3010 3030 3040 3050 3060 3090 3100 3110 3120 3140 3150 3160 3200 3210 3220 3
> 230 3245 3250 3255 3256 3258 3260 3261 3270 3300 3310 3320 3321 3322 3323 332
> 4 3330 3400 3401 3402 3420 3421 3422 3423 3424 3430 3500 3510 3515 3520 3535 
> 3540 3545 3550 3600 3601 3602 3603 3605 3610 3620 3630 3640 3645 3646 3647 36
> 48 3649 3655 3700 3710 3720 3725 3730 3740 3750 3800 3801 3802 3820 3840 3850
>  3870 3900 3910 3930 3940 3945 3946 3955 3960 4000 4010 4020 4030 4040 4050 4
> 055 4060 4110 4120 4130 4140 4150 4160 4200 4210 4220 4230 4240 4250 4251 425
> 2 4255 4300 4320 4330 4400 4410 4420 4430 4435 4460 4461 4465 4500 4510 4520 
> 4521 4522 4525 4530 4540 4600 4610 4620 4621 4622 4640 4650 4655 4700 4710 47
> 20 4740 4750 4760 4800 4810 4820 4830 4840 4850 4900 4920 4930 4940 4950 4965
>  5000 5010 5020 5030 5040 5100 5110 5120 5130 5140 5150 5160 5165 5200 5220 5
> 230 5240 5250 5260 5300 5310 5320 5330 5340 5350 5360 5400 5410 5420 5500 551
> 0 5520 5521 5522 5530 5540 5550 5560 5600 5610 5620 5630 5700 5710 5720 5730 
> 5740 5800 5810 5820 5840 5850 5860 5900 5910 5920 5940 6200 6210 6220 6230 62
> 40 6250 6260 6300 6305 6320 6330 6355 6360 6400 6410 6420 6440 6441 6442 6460
>  6500 6515 6520 6530 6540 6600 6660 6700 6710 6720 6730 6740 6750 6765 6800 6
> 820 6825 6830 6835 6840 6850 6920 6940 6950 7000 7010 7020 7030 7040 7100 711
> 0 7120 7130 7140 7150 7160 7200 7210 7220 7240 7260 7300 7315 7320 7330 7340 
> 7350 7360 7410 7420 7430 7510 7540 7550 7560 7610 7630 7640 7700 7710 7720 77
> 30 7740 7750 7800 7810 7830 7840 7850 7855 7900 7905 7920 7925 7940 7950 8000
>  8010 8025 8030 8040 8100 8130 8140 8200 8210 8220 8225 8250 8255 8256 8300 8
> 310 8320 8330 8335 8350 8365 8400 8410 8420 8450 8460 8465 8500 8510 8530 854
> 0 8550 8555 8600 8610 8620 8630 8640 8650 8710 8720 8730 8740 8750 8760 8800 
> 8810 8830 8850 8860 8910 8920 8930 8940 8950 8965 8990 9000 9005 9030 9040 90
> 50 9110 9120 9121 9122 9130 9140 9141 9142 9150 9200 9210 9240 9260 9265 9300
>  9310 9350 9360 9365 9410 9415 9420 9430 9510 9520 9560 9570 9600 9610 9620 9
> 630 9640 9645 9650 9720 9750 9760

. foreach x of local occs {
  2.     local lbl : label peio1ocd `x'
  3.     replace occ_lbl = "`lbl'" if occ == `x'
  4. }
variable occ_lbl was str1 now str26
(1,144 real changes made)
variable occ_lbl was str26 now str41
(1,587 real changes made)
variable occ_lbl was str41 now str45
(81 real changes made)
(822 real changes made)
(328 real changes made)
(323 real changes made)
(190 real changes made)
(191 real changes made)
(61 real changes made)
(129 real changes made)
variable occ_lbl was str45 now str51
(1,041 real changes made)
(1,942 real changes made)
(37 real changes made)
(539 real changes made)
(107 real changes made)
(485 real changes made)
(380 real changes made)
variable occ_lbl was str51 now str60
(505 real changes made)
(885 real changes made)
(1,957 real changes made)
(194 real changes made)
(1,061 real changes made)
(26 real changes made)
(34 real changes made)
(165 real changes made)
(1,121 real changes made)
(36 real changes made)
variable occ_lbl was str60 now str67
(671 real changes made)
(919 real changes made)
(31 real changes made)
(2,835 real changes made)
(2,460 real changes made)
variable occ_lbl was str67 now str73
(27 real changes made)
(23 real changes made)
(296 real changes made)
(425 real changes made)
(520 real changes made)
(514 real changes made)
(247 real changes made)
(1,139 real changes made)
(125 real changes made)
(255 real changes made)
(183 real changes made)
(649 real changes made)
(1,025 real changes made)
(147 real changes made)
(167 real changes made)
(461 real changes made)
(265 real changes made)
(396 real changes made)
(2,502 real changes made)
(95 real changes made)
(118 real changes made)
(52 real changes made)
(239 real changes made)
(186 real changes made)
(469 real changes made)
(195 real changes made)
(30 real changes made)
(532 real changes made)
(103 real changes made)
(95 real changes made)
(41 real changes made)
(53 real changes made)
(36 real changes made)
(816 real changes made)
(177 real changes made)
(686 real changes made)
(1,116 real changes made)
(1,062 real changes made)
(55 real changes made)
(171 real changes made)
(58 real changes made)
(33 real changes made)
(933 real changes made)
(100 real changes made)
(84 real changes made)
(397 real changes made)
(208 real changes made)
(446 real changes made)
(578 real changes made)
(36 real changes made)
(267 real changes made)
(324 real changes made)
(177 real changes made)
(127 real changes made)
(17 real changes made)
(78 real changes made)
(201 real changes made)
(35 real changes made)
(118 real changes made)
(652 real changes made)
(92 real changes made)
(423 real changes made)
(58 real changes made)
(426 real changes made)
(17 real changes made)
(75 real changes made)
(525 real changes made)
variable occ_lbl was str73 now str74
(5 real changes made)
(12 real changes made)
(36 real changes made)
(858 real changes made)
(132 real changes made)
(38 real changes made)
(73 real changes made)
(381 real changes made)
(59 real changes made)
(241 real changes made)
(119 real changes made)
(64 real changes made)
(236 real changes made)
(64 real changes made)
(219 real changes made)
(27 real changes made)
(22 real changes made)
(166 real changes made)
(100 real changes made)
(43 real changes made)
(33 real changes made)
(524 real changes made)
(76 real changes made)
(133 real changes made)
(10 real changes made)
(51 real changes made)
(46 real changes made)
(62 real changes made)
(105 real changes made)
(60 real changes made)
(37 real changes made)
(114 real changes made)
(12 real changes made)
(17 real changes made)
(156 real changes made)
(201 real changes made)
(56 real changes made)
(751 real changes made)
(80 real changes made)
(303 real changes made)
(14 real changes made)
(97 real changes made)
(18 real changes made)
(140 real changes made)
(773 real changes made)
(59 real changes made)
(62 real changes made)
(10 real changes made)
(523 real changes made)
(162 real changes made)
(384 real changes made)
variable occ_lbl was str74 now str119
(164 real changes made)
(761 real changes made)
(143 real changes made)
(130 real changes made)
(1,135 real changes made)
(21 real changes made)
(590 real changes made)
(131 real changes made)
(60 real changes made)
(42 real changes made)
(1,424 real changes made)
(1,040 real changes made)
(1,098 real changes made)
(6,422 real changes made)
(2,253 real changes made)
(751 real changes made)
(619 real changes made)
(74 real changes made)
(485 real changes made)
(130 real changes made)
(238 real changes made)
(177 real changes made)
(66 real changes made)
(958 real changes made)
(923 real changes made)
(176 real changes made)
(133 real changes made)
(131 real changes made)
(594 real changes made)
(3 real changes made)
(9 real changes made)
(29 real changes made)
(195 real changes made)
(37 real changes made)
(24 real changes made)
(211 real changes made)
(17 real changes made)
(192 real changes made)
(208 real changes made)
(13 real changes made)
(116 real changes made)
(12 real changes made)
(6 real changes made)
(84 real changes made)
(24 real changes made)
(31 real changes made)
(3 real changes made)
(14 real changes made)
(7 real changes made)
(34 real changes made)
(19 real changes made)
(126 real changes made)
(213 real changes made)
(250 real changes made)
(101 real changes made)
(217 real changes made)
(53 real changes made)
(41 real changes made)
(15 real changes made)
(9 real changes made)
(79 real changes made)
(44 real changes made)
(86 real changes made)
(82 real changes made)
(20 real changes made)
(50 real changes made)
(183 real changes made)
(35 real changes made)
(485 real changes made)
(268 real changes made)
(238 real changes made)
(6 real changes made)
(209 real changes made)
(4 real changes made)
(34 real changes made)
(231 real changes made)
(454 real changes made)
(27 real changes made)
(23 real changes made)
(163 real changes made)
(317 real changes made)
(315 real changes made)
(123 real changes made)
(5,174 real changes made)
(20 real changes made)
(405 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(520 real changes made)
(360 real changes made)
(311 real changes made)
(40 real changes made)
(58 real changes made)
(172 real changes made)
(30 real changes made)
(20 real changes made)
(149 real changes made)
(81 real changes made)
(64 real changes made)
(571 real changes made)
(238 real changes made)
(48 real changes made)
(74 real changes made)
(86 real changes made)
(55 real changes made)
(772 real changes made)
(173 real changes made)
(172 real changes made)
(82 real changes made)
(95 real changes made)
(100 real changes made)
(92 real changes made)
(52 real changes made)
(1,318 real changes made)
(285 real changes made)
(801 real changes made)
(657 real changes made)
(38 real changes made)
(46 real changes made)
(136 real changes made)
(91 real changes made)
(424 real changes made)
(729 real changes made)
(60 real changes made)
(51 real changes made)
(82 real changes made)
(158 real changes made)
(294 real changes made)
(79 real changes made)
(194 real changes made)
(94 real changes made)
(53 real changes made)
(66 real changes made)
(412 real changes made)
(40 real changes made)
(255 real changes made)
(13 real changes made)
(156 real changes made)
(241 real changes made)
(31 real changes made)
(527 real changes made)
(440 real changes made)
(11 real changes made)
(136 real changes made)
(1,110 real changes made)
(85 real changes made)
(62 real changes made)
(14 real changes made)
(103 real changes made)
(90 real changes made)
(459 real changes made)
(717 real changes made)
(2,338 real changes made)
(1,104 real changes made)
(439 real changes made)
(252 real changes made)
(346 real changes made)
(109 real changes made)
(1,658 real changes made)
(268 real changes made)
(370 real changes made)
(288 real changes made)
(306 real changes made)
(4 real changes made)
(315 real changes made)
(146 real changes made)
(3,023 real changes made)
(1,185 real changes made)
(102 real changes made)
(667 real changes made)
(439 real changes made)
(46 real changes made)
(8 real changes made)
(119 real changes made)
(47 real changes made)
(68 real changes made)
(119 real changes made)
(2 real changes made)
(46 real changes made)
(136 real changes made)
(106 real changes made)
(7 real changes made)
(9 real changes made)
(34 real changes made)
(38 real changes made)
(373 real changes made)
(128 real changes made)
(45 real changes made)
(24 real changes made)
(3 real changes made)
(93 real changes made)
(67 real changes made)
(770 real changes made)
(941 real changes made)
(271 real changes made)
(70 real changes made)
(110 real changes made)
(52 real changes made)
(60 real changes made)
(42 real changes made)
(3,707 real changes made)
(1,365 real changes made)
(3,442 real changes made)
(138 real changes made)
(181 real changes made)
(3,289 real changes made)
(168 real changes made)
(612 real changes made)
(170 real changes made)
(53 real changes made)
(566 real changes made)
(1,657 real changes made)
(55 real changes made)
(401 real changes made)
(64 real changes made)
(45 real changes made)
(56 real changes made)
(373 real changes made)
(2,262 real changes made)
(29 real changes made)
(47 real changes made)
(10 real changes made)
(4 real changes made)
(166 real changes made)
(727 real changes made)
(1,697 real changes made)
(7 real changes made)
(222 real changes made)
(62 real changes made)
(391 real changes made)
(116 real changes made)
(3 real changes made)
(111 real changes made)
(73 real changes made)
(3,420 real changes made)
(151 real changes made)
(246 real changes made)
(163 real changes made)
(248 real changes made)
(170 real changes made)
(217 real changes made)
(37 real changes made)
(129 real changes made)
(91 real changes made)
(1,733 real changes made)
(153 real changes made)
(187 real changes made)
(31 real changes made)
(491 real changes made)
(233 real changes made)
(60 real changes made)
(116 real changes made)
(47 real changes made)
(161 real changes made)
(496 real changes made)
(97 real changes made)
(438 real changes made)
(870 real changes made)
(1,129 real changes made)
(99 real changes made)
(2,563 real changes made)
(165 real changes made)
(37 real changes made)
(55 real changes made)
(1,463 real changes made)
(61 real changes made)
(353 real changes made)
(88 real changes made)
(416 real changes made)
(79 real changes made)
(1,574 real changes made)
(58 real changes made)
(20 real changes made)
(59 real changes made)
(881 real changes made)
(914 real changes made)
(21 real changes made)
(132 real changes made)
(1,034 real changes made)
(122 real changes made)
(82 real changes made)
(1,454 real changes made)
(13 real changes made)
(259 real changes made)
(315 real changes made)
(158 real changes made)
(1,137 real changes made)
(54 real changes made)
(69 real changes made)
(145 real changes made)
(235 real changes made)
(410 real changes made)
(31 real changes made)
(300 real changes made)
(26 real changes made)
(7 real changes made)
(161 real changes made)
(202 real changes made)
(60 real changes made)
(11 real changes made)
(54 real changes made)
(140 real changes made)
(41 real changes made)
(34 real changes made)
(33 real changes made)
(161 real changes made)
(20 real changes made)
(6 real changes made)
(49 real changes made)
(54 real changes made)
(16 real changes made)
(20 real changes made)
(9 real changes made)
(6 real changes made)
(70 real changes made)
(27 real changes made)
(6 real changes made)
(45 real changes made)
(39 real changes made)
(461 real changes made)
(228 real changes made)
(202 real changes made)
(19 real changes made)
(38 real changes made)
(39 real changes made)
(6 real changes made)
(44 real changes made)
(85 real changes made)
(244 real changes made)
(176 real changes made)
(23 real changes made)
(930 real changes made)
(508 real changes made)
(393 real changes made)
(69 real changes made)
(106 real changes made)
(35 real changes made)
(554 real changes made)
(46 real changes made)
(696 real changes made)
(924 real changes made)
(39 real changes made)
(77 real changes made)
(180 real changes made)
(230 real changes made)
(98 real changes made)
(57 real changes made)
(28 real changes made)
(4 real changes made)
(16 real changes made)
(20 real changes made)
(132 real changes made)
(86 real changes made)
(1,360 real changes made)
(8 real changes made)
(198 real changes made)
(15 real changes made)
(35 real changes made)
(1,336 real changes made)
(316 real changes made)
(386 real changes made)
(15 real changes made)
(132 real changes made)
(12 real changes made)
(216 real changes made)
(96 real changes made)
(70 real changes made)
(12 real changes made)
(17 real changes made)
(16 real changes made)
(114 real changes made)
(70 real changes made)
(18 real changes made)
(9 real changes made)
(549 real changes made)
(39 real changes made)
(56 real changes made)
(81 real changes made)
(808 real changes made)
(15 real changes made)
(3 real changes made)
(326 real changes made)
(219 real changes made)
(25 real changes made)
(225 real changes made)
(26 real changes made)
(212 real changes made)
(49 real changes made)
(189 real changes made)
(1 real change made)
(8 real changes made)
(49 real changes made)
(14 real changes made)
(5 real changes made)
(9 real changes made)
(9 real changes made)
(19 real changes made)
(18 real changes made)
(6 real changes made)
(72 real changes made)
(14 real changes made)
(46 real changes made)
(30 real changes made)
(22 real changes made)
(11 real changes made)
(71 real changes made)
(120 real changes made)
(193 real changes made)
(79 real changes made)
(108 real changes made)
(105 real changes made)
(79 real changes made)
(37 real changes made)
(23 real changes made)
(1,212 real changes made)
(42 real changes made)
(122 real changes made)
(373 real changes made)
(187 real changes made)
(31 real changes made)
(12 real changes made)
(2 real changes made)
(9 real changes made)
(43 real changes made)
(29 real changes made)
(8 real changes made)
(53 real changes made)
(763 real changes made)
(702 real changes made)
(172 real changes made)
(214 real changes made)
(139 real changes made)
(45 real changes made)
(105 real changes made)
(13 real changes made)
(517 real changes made)
(162 real changes made)
(171 real changes made)
(4,280 real changes made)
(259 real changes made)
(30 real changes made)
(58 real changes made)
(162 real changes made)
(42 real changes made)
(53 real changes made)
(83 real changes made)
(15 real changes made)
(13 real changes made)
(27 real changes made)
(24 real changes made)
(95 real changes made)
(76 real changes made)
(55 real changes made)
(60 real changes made)
(44 real changes made)
(21 real changes made)
(16 real changes made)
(110 real changes made)
(22 real changes made)
(7 real changes made)
(15 real changes made)
(775 real changes made)
(363 real changes made)
(2,467 real changes made)
(31 real changes made)
(659 real changes made)
(988 real changes made)
(31 real changes made)
(108 real changes made)
(39 real changes made)
(34 real changes made)

. 
. * Extract OES occupation code from label (e.g., 35-2010)
. gen str oes_occ_code = ""
(197,801 missing values generated)

. replace oes_occ_code = regexs(1) if regexm(occ_lbl, "([0-9]{2}-[0-9]{4})")
variable oes_occ_code was str1 now str7
(166,287 real changes made)

. 
. gen str occ_clean = regexs(1) if regexm(occ_lbl, "^(.*?)[\s\(]+[0-9]{2}-[0-9]
> {4}\)?$")
(31,514 missing values generated)

. 
. ********* Manual Occupation Code Fix ************
. *** Case 1: No Conflicting Telework Indicator between ATL and DN ***
. *** Action: Choose occupation code with the closest meaning
. replace oes_occ_code = "49-2093"  if occ_lbl == "Electrical and electronics r
> epairers, industrial and utility 49-209X"
(39 real changes made)

. replace oes_occ_code = "39-4011"  if occ_lbl == "Embalmers and funeral attend
> ants 39-40XX"
(7 real changes made)

. replace oes_occ_code = "49-9041"  if occ_lbl == "Industrial and refractory ma
> chinery mechanics 49-904X"
(696 real changes made)

. replace oes_occ_code = "37-2011"  if occ_lbl == "Janitors and building cleane
> rs 31-201X" // Forcing the label defined in DingleNeiman data
(3,023 real changes made)

. replace oes_occ_code = "47-5011"  if occ_lbl == "Other extraction workers 47-
> 50XX"
(45 real changes made)

. replace oes_occ_code = "53-6011"  if occ_lbl == "Other transportation workers
>  53-60XX"
(21 real changes made)

. replace oes_occ_code = "15-1131"  if occ_lbl == "Software developers, applica
> tions and systems software 15-113X"
(1,116 real changes made)

. replace oes_occ_code = "53-4041"  if occ_lbl == "Subway, streetcar, and other
>  rail transportation workers 53-40XX"
(15 real changes made)

. replace oes_occ_code = "11-2021"  if occ_lbl == "Marketing and sales managers
>  (11-2020)"
(822 real changes made)

. replace oes_occ_code = "13-1020"  if occ_lbl == "Purchasing agents and buyers
> , farm products 13-1021"
(23 real changes made)

. replace oes_occ_code = "13-1020"  if occ_lbl == "Wholesale and retail buyers,
>  except farm products 13-1022"
(296 real changes made)

. replace oes_occ_code = "13-1020"  if occ_lbl == "Purchasing agents, except wh
> olesale, retail, and farm products 13-1023"
(425 real changes made)

. replace oes_occ_code = "13-1071"  if occ_lbl == "Human resource workers 13-10
> 70"
(1,139 real changes made)

. replace oes_occ_code = "13-2071"  if occ_lbl == "Loan counselors and officers
>  13-2070"
(532 real changes made)

. replace oes_occ_code = "15-1151"  if occ_lbl == "Computer support specialists
>  15-1150"
(933 real changes made)

. replace oes_occ_code = "15-2021"  if occ_lbl == "Miscellaneous mathematical s
> cience occupations 15-2090"
(324 real changes made)

. replace oes_occ_code = "17-1011"  if occ_lbl == "Architects, except naval 17-
> 1010"
(177 real changes made)

. replace oes_occ_code = "17-2071"  if occ_lbl == "Electrical and electronic en
> gineers 17-2070"
(423 real changes made)

. replace oes_occ_code = "17-3011"  if occ_lbl == "Drafters 17-3010"
(132 real changes made)

. replace oes_occ_code = "19-1041"  if occ_lbl == "Medical scientists 19-1040"
(219 real changes made)

. replace oes_occ_code = "19-2011"  if occ_lbl == "Astronomers and physicists 1
> 9-2010"
(27 real changes made)

. replace oes_occ_code = "19-2031"  if occ_lbl == "Chemists and materials scien
> tists 19-2030"
(166 real changes made)

. replace oes_occ_code = "19-2041"  if occ_lbl == "Environmental scientists and
>  geoscientists 19-2040"
(100 real changes made)

. replace oes_occ_code = "19-3031"  if occ_lbl == "Psychologists 19-3030"
(133 real changes made)

. replace oes_occ_code = "21-1021" if occ_lbl == "Social workers 21-1020"
(773 real changes made)

. replace oes_occ_code = "21-2011" if occ_lbl == "Religious workers, all other 
> 21-2099"
(130 real changes made)

. replace oes_occ_code = "23-2091" if occ_lbl == "Miscellaneous legal support w
> orkers 23-2090"
(131 real changes made)

. replace oes_occ_code = "25-1011" if occ_lbl == "Postsecondary teachers 25-100
> 0"
(1,424 real changes made)

. replace oes_occ_code = "25-2011" if occ_lbl == "Preschool and kindergarten te
> achers 25-2010"
(1,098 real changes made)

. replace oes_occ_code = "25-2021" if occ_lbl == "Elementary and middle school 
> teachers 25-2020"
(6,422 real changes made)

. replace oes_occ_code = "25-2031" if occ_lbl == "Secondary school teachers 25-
> 2030"
(2,253 real changes made)

. replace oes_occ_code = "25-2051" if occ_lbl == "Special education teachers 25
> -2040"
(751 real changes made)

. replace oes_occ_code = "25-3011" if occ_lbl == "Other teachers and instructor
> s 25-3000"
(619 real changes made)

. replace oes_occ_code = "27-2031" if occ_lbl == "Dancers and choreographers 27
> -2030"
(6 real changes made)

. replace oes_occ_code = "27-2042" if occ_lbl == "Entertainers and performers, 
> sports and related workers, all other 27-2099"
(14 real changes made)

. replace oes_occ_code = "27-3091" if occ_lbl == "Miscellaneous media and commu
> nication workers 27-3090"
(53 real changes made)

. replace oes_occ_code = "27-4011" if occ_lbl == "Broadcast and sound engineeri
> ng technicians and radio operators 27-4010"
(79 real changes made)

. replace oes_occ_code = "29-1021" if occ_lbl == "Dentists 29-1020"
(50 real changes made)

. replace oes_occ_code = "29-2031" if occ_lbl == "Diagnostic related technologi
> sts and technicians 29-2030"
(311 real changes made)

. replace oes_occ_code = "29-2051" if occ_lbl == "Health diagnosing and treatin
> g practitioner support technicians 29-2050"
(571 real changes made)

. replace oes_occ_code = "29-2091" if occ_lbl == "Miscellaneous health technolo
> gists and technicians 29-2090"
(95 real changes made)

. replace oes_occ_code = "31-1011" if occ_lbl == "Nursing, psychiatric, and hom
> e health aides 31-1010"
(1,318 real changes made)

. replace oes_occ_code = "31-2011" if occ_lbl == "Occupational therapist assist
> ants and aides 31-2010"
(46 real changes made)

. replace oes_occ_code = "31-2021" if occ_lbl == "Physical therapist assistants
>  and aides 31-2020"
(136 real changes made)

. replace oes_occ_code = "33-1021" if occ_lbl == "Supervisors, protective servi
> ce workers, all other 33-1099"
(66 real changes made)

. replace oes_occ_code = "33-2021" if occ_lbl == "Fire inspectors 33-2020"
(40 real changes made)

. replace oes_occ_code = "33-3011" if occ_lbl == "Bailiffs, correctional office
> rs, and jailers 33-3010"
(255 real changes made)

. replace oes_occ_code = "35-3021" if occ_lbl == "Food preparation and serving 
> related workers, all other 35-9099"
(4 real changes made)

. replace oes_occ_code = "37-3011" if occ_lbl == "Grounds maintenance workers 3
> 7-3010"
(667 real changes made)

. replace oes_occ_code = "39-3091" if occ_lbl == "Miscellaneous entertainment a
> ttendants and related workers 39-3090"
(136 real changes made)

. replace oes_occ_code = "39-6011" if occ_lbl == "Baggage porters, bellhops, an
> d concierges 39-6010"
(93 real changes made)

. replace oes_occ_code = "39-7010" if occ_lbl == "Tour and travel guides 39-602
> 0"
(67 real changes made)

. replace oes_occ_code = "39-9021" if occ_lbl == "Personal care and service wor
> kers, all other 39-9099"
(60 real changes made)

. replace oes_occ_code = "41-2011" if occ_lbl == "Cashiers 41-2010"
(3,442 real changes made)

. replace oes_occ_code = "41-4011" if occ_lbl == "Sales representatives, wholes
> ale and manufacturing 41-4010"
(1,657 real changes made)

. replace oes_occ_code = "41-9091" if occ_lbl == "Sales and related workers, al
> l other 41-9099"
(373 real changes made)

. replace oes_occ_code = "43-2021" if occ_lbl == "Communications equipment oper
> ators, all other 43-2099"
(10 real changes made)

. replace oes_occ_code = "43-3031" if occ_lbl == "Financial clerks, all other 4
> 3-3099"
(116 real changes made)

. replace oes_occ_code = "43-6011" if occ_lbl == "Secretaries and administrativ
> e assistants 43-6010"
(2,563 real changes made)

. replace oes_occ_code = "43-9111" if occ_lbl == "Office and administrative sup
> port workers, all other 43-9199"
(881 real changes made)

. replace oes_occ_code = "47-2021" if occ_lbl == "Brickmasons, blockmasons, and
>  stonemasons 47-2020"
(132 real changes made)

. replace oes_occ_code = "47-2041" if occ_lbl == "Carpet, floor, and tile insta
> llers and finishers 47-2040"
(122 real changes made)

. replace oes_occ_code = "47-2051" if occ_lbl == "Cement masons, concrete finis
> hers, and terrazzo workers 47-2050"
(82 real changes made)

. replace oes_occ_code = "47-2081" if occ_lbl == "Drywall installers, ceiling t
> ile installers, and tapers 47-2080"
(158 real changes made)

. replace oes_occ_code = "47-2131" if occ_lbl == "Insulation workers 47-2130"
(69 real changes made)

. replace oes_occ_code = "47-2151" if occ_lbl == "Pipelayers, plumbers, pipefit
> ters, and steamfitters 47-2150"
(410 real changes made)

. replace oes_occ_code = "47-3011" if occ_lbl == "Helpers, construction trades 
> 47-3010"
(54 real changes made)

. replace oes_occ_code = "47-5011" if occ_lbl == "Derrick, rotary drill, and se
> rvice unit operators, oil, gas, and mining 47-5010"
(54 real changes made)

. replace oes_occ_code = "47-5041" if occ_lbl == "Mining machine operators 47-5
> 040"
(70 real changes made)

. replace oes_occ_code = "49-2021" if occ_lbl == "Radio and telecommunications 
> equipment installers and repairers 49-2020"
(202 real changes made)

. replace oes_occ_code = "49-3041" if occ_lbl == "Heavy vehicle and mobile equi
> pment service technicians and mechanics 49-3040"
(393 real changes made)

. replace oes_occ_code = "49-3051" if occ_lbl == "Small engine mechanics 49-305
> 0"
(69 real changes made)

. replace oes_occ_code = "49-3091" if occ_lbl == "Miscellaneous vehicle and mob
> ile equipment mechanics, installers, and repairers 49-3090"
(106 real changes made)

. replace oes_occ_code = "49-9011" if occ_lbl == "Control and valve installers 
> and repairers 49-9010"
(35 real changes made)

. replace oes_occ_code = "49-9043" if occ_lbl == "Maintenance and repair worker
> s, general 49-9042"
(924 real changes made)

. replace oes_occ_code = "49-9061" if occ_lbl == "Precision instrument and equi
> pment repairers 49-9060"
(98 real changes made)

. replace oes_occ_code = "51-2028" if occ_lbl == "Electrical, electronics, and 
> electromechanical assemblers 51-2020"
(198 real changes made)

. replace oes_occ_code = "51-2091" if occ_lbl == "Miscellaneous assemblers and 
> fabricators 51-2090"
(1,336 real changes made)

. replace oes_occ_code = "51-3021" if occ_lbl == "Butchers and other meat, poul
> try, and fish processing workers 51-3020"
(386 real changes made)

. replace oes_occ_code = "51-3093" if occ_lbl == "Food processing workers, all 
> other 51-3099"
(216 real changes made)

. replace oes_occ_code = "51-4011" if occ_lbl == "Computer control programmers 
> and operators 51-4010"
(96 real changes made)

. replace oes_occ_code = "51-4051" if occ_lbl == "Metal furnace and kiln operat
> ors and tenders 51-4050"
(39 real changes made)

. replace oes_occ_code = "51-4071" if occ_lbl == "Molders and molding machine s
> etters, operators, and tenders, metal and plastic 51-4070"
(56 real changes made)

. replace oes_occ_code = "51-4121" if occ_lbl == "Welding, soldering, and brazi
> ng workers 51-4120"
(808 real changes made)

. replace oes_occ_code = "51-4191" if occ_lbl == "Metalworkers and plastic work
> ers, all other 51-4199"
(326 real changes made)

. replace oes_occ_code = "51-6051" if occ_lbl == "Tailors, dressmakers, and sew
> ers 51-6050"
(49 real changes made)

. replace oes_occ_code = "51-7042" if occ_lbl == "Woodworkers, all other 51-709
> 9"
(22 real changes made)

. replace oes_occ_code = "51-8013" if occ_lbl == "Power plant operators, distri
> butors, and dispatchers 51-8010"
(71 real changes made)

. replace oes_occ_code = "51-8091" if occ_lbl == "Miscellaneous plant and syste
> m operators 51-8090"
(79 real changes made)

. replace oes_occ_code = "51-9011" if occ_lbl == "Chemical processing machine s
> etters, operators, and tenders 51-9010"
(108 real changes made)

. replace oes_occ_code = "51-9021" if occ_lbl == "Crushing, grinding, polishing
> , mixing, and blending workers 51-9020"
(105 real changes made)

. replace oes_occ_code = "51-9031" if occ_lbl == "Cutting workers 51-9030"
(79 real changes made)

. replace oes_occ_code = "51-9081" if occ_lbl == "Medical, dental, and ophthalm
> ic laboratory technicians 51-9080"
(122 real changes made)

. replace oes_occ_code = "51-9151" if occ_lbl == "Photographic process workers 
> and processing machine operators 51-9130"
(31 real changes made)

. replace oes_occ_code = "53-1048" if occ_lbl == "Supervisors, transportation a
> nd material moving workers 53-1000"
(172 real changes made)

. replace oes_occ_code = "53-2011" if occ_lbl == "Aircraft pilots and flight en
> gineers 53-2010"
(139 real changes made)

. replace oes_occ_code = "53-2021" if occ_lbl == "Air traffic controllers and a
> irfield operations specialists 53-2020"
(45 real changes made)

. replace oes_occ_code = "53-3021" if occ_lbl == "Bus drivers 53-3020"
(517 real changes made)

. replace oes_occ_code = "53-3031" if occ_lbl == "Driver/sales workers and truc
> k drivers 53-3030"
(4,280 real changes made)

. replace oes_occ_code = "53-3041" if occ_lbl == "Motor vehicle operators, all 
> other 53-3099"
(162 real changes made)

. replace oes_occ_code = "53-4011" if occ_lbl == "Locomotive engineers and oper
> ators 53-4010"
(42 real changes made)

. replace oes_occ_code = "53-5021" if occ_lbl == "Ship and boat captains and op
> erators 53-5020"
(24 real changes made)

. replace oes_occ_code = "53-7031" if occ_lbl == "Dredge, excavating, and loadi
> ng machine operators 53-7030"
(22 real changes made)

. replace oes_occ_code = "53-7071" if occ_lbl == "Pumping station operators 53-
> 7070"
(31 real changes made)

. replace oes_occ_code = "53-7121" if occ_lbl == "Material moving workers, all 
> other 53-7199"
(39 real changes made)

. 
. *** Case 2: Conflicting Telework Indicator between ATL and DN ***
. *** Action: Determine Telework indicator, then choose occupation code with th
> e closest meaning
. 
. replace oes_occ_code = "33-9092"  if occ_lbl == "Lifeguards and other recreat
> ional and all other protective service workers 33-909X"
(103 real changes made)

. // 33-9091      Crossing Guards 0
. // 33-9092      Lifeguards, Ski Patrol, and Other Recreational Protective Ser
> vice Workers       0
. // 33-9093      Transportation Security Screeners       0
. // 33-9099      Protective Service Workers, All Other   1
. 
. replace oes_occ_code = "21-1091"  if occ_lbl == "Miscellaneous community and 
> social service specialists, including health educators and community health w
> orkers 21-109X"
(164 real changes made)

. // 21-1091      Health Educators        0
. // 21-1092      Probation Officers and Correctional Treatment Specialists    
>    1
. // 21-1093      Social and Human Service Assistants     0
. // 21-1094      Community Health Workers        0
. 
. replace oes_occ_code = "31-9091"  if occ_lbl == "Miscellaneous healthcare sup
> port occupations, including medical equipment preparers 31-909X"
(294 real changes made)

. // 31-9091      Dental Assistants       0
. // 31-9092      Medical Assistants      0
. // 31-9093      Medical Equipment Preparers     0
. // 31-9094      Medical Transcriptionists       1
. // 31-9095      Pharmacy Aides  0
. // 31-9096      Veterinary Assistants and Laboratory Animal Caretakers  0
. // 31-9097      Phlebotomists   0
. // 31-9099      Healthcare Support Workers, All Other   .3150525
. 
. replace oes_occ_code = "25-9011"  if occ_lbl == "Other education, training, a
> nd library workers 25-90XX"
(176 real changes made)

. // 25-9011      Audio-Visual and Multimedia Collections Specialists     1
. // 25-9021      Farm and Home Management Advisors       0
. // 25-9031      Instructional Coordinators      1
. // 25-9041      Teacher Assistants      1
. 
. replace oes_occ_code = "49-9092"  if occ_lbl == "Other installation, maintena
> nce, and repair workers 49-909X"
(132 real changes made)

. // 49-9091      Coin, Vending, and Amusement Machine Servicers and Repairers 
>    1
. // 49-9092      Commercial Divers       0
. // 49-9093      Fabric Menders, Except Garment  0
. // 49-9094      Locksmiths and Safe Repairers   0
. // 49-9095      Manufactured Building and Mobile Home Installers        0
. // 49-9096      Riggers 0
. // 49-9097      Signal and Track Switch Repairers       0
. // 49-9098      Helpers--Installation, Maintenance, and Repair Workers  0
. // 49-9099      Installation, Maintenance, and Repair Workers, All Other     
>    0
. 
. replace oes_occ_code = "11-9032"  if occ_lbl == "Education administrators (11
> -9030)"
(1,957 real changes made)

. // 11-9031      Education Administrators, Preschool and Childcare Center/Prog
> ram        0
. // 11-9032      Education Administrators, Elementary and Secondary School    
>    1
. // 11-9033      Education Administrators, Postsecondary 1
. // 11-9039      Education Administrators, All Other     1
. 
. replace oes_occ_code = "13-1031"  if occ_lbl == "Claims adjusters, appraisers
> , examiners, and investigators 13-1030"
(520 real changes made)

. // 13-1031      Claims Adjusters, Examiners, and Investigators  1
. // 13-1032      Insurance Appraisers, Auto Damage       0
. 
. replace oes_occ_code = "17-2021"  if occ_lbl == "Surveyors, cartographers, an
> d photogrammetrists 17-1020"
(78 real changes made)

. // 17-1021      Cartographers and Photogrammetrists     1
. // 17-1022      Surveyors       .3928129
. 
. replace oes_occ_code = "17-2112"  if occ_lbl == "Industrial engineers, includ
> ing health and safety 17-2110"
(426 real changes made)

. // 17-2111      Health and Safety Engineers, Except Mining Safety Engineers a
> nd Inspectors      .343295
. // 17-2112      Industrial Engineers    .4186046
. 
. replace oes_occ_code = "17-3029"  if occ_lbl == "Engineering technicians, exc
> ept drafters 17-3020"
(381 real changes made)

. // 17-3021      Aerospace Engineering and Operations Technicians        0
. // 17-3022      Civil Engineering Technicians   1
. // 17-3023      Electrical and Electronics Engineering Technicians      0
. // 17-3024      Electro-Mechanical Technicians  0
. // 17-3025      Environmental Engineering Technicians   0
. // 17-3026      Industrial Engineering Technicians      0
. // 17-3027      Mechanical Engineering Technicians      0
. // 17-3029      Engineering Technicians, Except Drafters, All Other     0
. 
. replace oes_occ_code = "19-1011"  if occ_lbl == "Agricultural and food scient
> ists 19-1010"
(64 real changes made)

. // 19-1011      Animal Scientists       1
. // 19-1012      Food Scientists and Technologists       0
. // 19-1013      Soil and Plant Scientists       1
. 
. replace oes_occ_code = "19-1021"  if occ_lbl == "Biological scientists 19-102
> 0"
(236 real changes made)

. // 19-1021      Biochemists and Biophysicists   0
. // 19-1022      Microbiologists 0
. // 19-1023      Zoologists and Wildlife Biologists      1
. // 19-1029      Biological Scientists, All Other        .7094972
. 
. replace oes_occ_code = "19-1032"  if occ_lbl == "Conservation scientists and 
> foresters 19-1030"
(64 real changes made)

. // 19-1031      Conservation Scientists .3236994
. // 19-1032      Foresters       0
. 
. replace oes_occ_code = "19-3091" if occ_lbl == "Miscellaneous social scientis
> ts and related workers 19-3090"
(105 real changes made)

. // 19-3091      Anthropologists and Archeologists       1
. // 19-3092      Geographers     1
. // 19-3093      Historians      0
. // 19-3094      Political Scientists    1
. // 19-3099      Social Scientists and Related Workers, All Other        1
. 
. replace oes_occ_code = "19-4091" if occ_lbl == "Miscellaneous life, physical,
>  and social science technicians 19-4090"
(156 real changes made)

. // 19-4091      Environmental Science and Protection Technicians, Including H
> ealth      0
. // 19-4092      Forensic Science Technicians    0
. // 19-4093      Forest and Conservation Technicians     0
. // 19-4099      Life, Physical, and Social Science Technicians, All Other    
>    .5376737
. 
. replace oes_occ_code = "21-1012" if occ_lbl == "Counselors 21-1010"
(751 real changes made)

. // 21-1012      Educational, Guidance, School, and Vocational Counselors     
>    1
. // 21-1013      Marriage and Family Therapists  1
. // 21-1015      Rehabilitation Counselors       1
. // 21-1018      Substance Abuse, Behavioral Disorder, and Mental Health Couns
> elors      .5
. 
. replace oes_occ_code = "25-4011" if occ_lbl == "Archivists, curators, and mus
> eum technicians 25-4010"
(130 real changes made)

. // 25-4011      Archivists      1
. // 25-4012      Curators        1
. // 25-4013      Museum Technicians and Conservators     0
. 
. replace oes_occ_code = "27-1011" if occ_lbl == "Artists and related workers 2
> 7-1010"
(131 real changes made)

. // 27-1011      Art Directors   1
. // 27-1012      Craft Artists   0
. // 27-1013      Fine Artists, Including Painters, Sculptors, and Illustrators
>    1
. // 27-1014      Multimedia Artists and Animators        1
. 
. replace oes_occ_code = "27-1021" if occ_lbl == "Designers 27-1020"
(594 real changes made)

. // 27-1021      Commercial and Industrial Designers     1
. // 27-1022      Fashion Designers       1
. // 27-1023      Floral Designers        1
. // 27-1024      Graphic Designers       1
. // 27-1025      Interior Designers      1
. // 27-1026      Merchandise Displayers and Window Trimmers      0
. // 27-1027      Set and Exhibit Designers       1
. 
. replace oes_occ_code = "27-2042" if occ_lbl == "Musicians, singers, and relat
> ed workers 27-2040"
(84 real changes made)

. // 27-2041      Music Directors and Composers   .4378613
. // 27-2042      Musicians and Singers   0
. 
. replace oes_occ_code = "27-3011" if occ_lbl == "Announcers 27-3010"
(34 real changes made)

. // 27-3011      Radio and Television Announcers 0
. // 27-3012      Public Address System and Other Announcers      1
. 
. replace oes_occ_code = "27-3022" if occ_lbl == "News analysts, reporters and 
> correspondents 27-3020"
(126 real changes made)

. // 27-3021      Broadcast News Analysts 0
. // 27-3022      Reporters and Correspondents    1
. 
. replace oes_occ_code = "27-4032" if occ_lbl == "Television, video, and motion
>  picture camera operators and editors 27-4030"
(82 real changes made)

. // 27-4031      Camera Operators, Television, Video, and Motion Picture 0
. // 27-4032      Film and Video Editors  1
. 
. replace oes_occ_code = "29-1061" if occ_lbl == "Physicians and surgeons 29-10
> 60"
(268 real changes made)

. // 29-1061      Anesthesiologists       0
. // 29-1062      Family and General Practitioners        0
. // 29-1063      Internists, General     0
. // 29-1064      Obstetricians and Gynecologists 0
. // 29-1065      Pediatricians, General  0
. // 29-1066      Psychiatrists   1
. // 29-1067      Surgeons        0
. // 29-1069      Physicians and Surgeons, All Other      .1046015
. 
. replace oes_occ_code = "29-1122" if occ_lbl == "Audiologists 29-1121"
(34 real changes made)

. replace oes_occ_code = "29-1123" if occ_lbl == "Therapists, all other 29-1129
> "
(315 real changes made)

. // 29-1122      Occupational Therapists 0
. // 29-1123      Physical Therapists     0
. // 29-1124      Radiation Therapists    0
. // 29-1125      Recreational Therapists .7478685
. // 29-1126      Respiratory Therapists  0
. // 29-1127      Speech-Language Pathologists    1
. // 29-1128      Exercise Physiologists  0
. 
. replace oes_occ_code = "29-9011" if occ_lbl == "Other healthcare practitioner
> s and technical occupations 29-9000"
(100 real changes made)

. // 29-9011      Occupational Health and Safety Specialists      0
. // 29-9012      Occupational Health and Safety Technicians      0
. // 29-9091      Athletic Trainers       1
. // 29-9092      Genetic Counselors      1
. // 29-9099      Healthcare Practitioners and Technical Workers, All Other    
>    0
. 
. replace oes_occ_code = "35-2011" if occ_lbl == "Cooks 35-2010"
(2,338 real changes made)

. // 35-2011      Cooks, Fast Food        0
. // 35-2012      Cooks, Institution and Cafeteria        0
. // 35-2013      Cooks, Private Household        1
. // 35-2014      Cooks, Restaurant       0
. // 35-2015      Cooks, Short Order      0
. 
. replace oes_occ_code = "39-3011" if occ_lbl == "Gaming services workers 39-30
> 10"
(119 real changes made)

. // 39-3011      Gaming Dealers  1
. // 39-3012      Gaming and Sports Book Writers and Runners      0
. 
. replace oes_occ_code = "39-5092" if occ_lbl == "Miscellaneous personal appear
> ance workers 39-5090"
(128 real changes made)

. // 39-5091      Makeup Artists, Theatrical and Performance      1
. // 39-5092      Manicurists and Pedicurists     0
. // 39-5093      Shampooers      0
. // 39-5094      Skincare Specialists    0
. 
. replace oes_occ_code = "39-9031" if occ_lbl == "Recreation and fitness worker
> s 39-9030"
(271 real changes made)

. // 39-9031      Fitness Trainers and Aerobics Instructors       0
. // 39-9032      Recreation Workers      1
. 
. replace oes_occ_code = "41-9012" if occ_lbl == "Models, demonstrators, and pr
> oduct promoters 41-9010"
(55 real changes made)

. // 41-9011      Demonstrators and Product Promoters     0
. // 41-9012      Models  1
. 
. replace oes_occ_code = "41-9021" if occ_lbl == "Real estate brokers and sales
>  agents 41-9020"
(401 real changes made)

. // 41-9021      Real Estate Brokers     1
. // 41-9022      Real Estate Sales Agents        0
. 
. replace oes_occ_code = "43-4121" if occ_lbl == "Information and record clerks
> , all other 43-4199"
(187 real changes made)

. // 43-4111      Interviewers, Except Eligibility and Loan       1
. // 43-4121      Library Assistants, Clerical    0
. // 43-4131      Loan Interviewers and Clerks    0
. // 43-4141      New Accounts Clerks     0
. // 43-4151      Order Clerks    1
. // 43-4161      Human Resources Assistants, Except Payroll and Timekeeping   
>    1
. // 43-4171      Receptionists and Information Clerks    0
. // 43-4181      Reservation and Transportation Ticket Agents and Travel Clerk
> s  0
. 
. replace oes_occ_code = "43-5031" if occ_lbl == "Dispatchers 43-5030"
(233 real changes made)

. // 43-5031      Police, Fire, and Ambulance Dispatchers 0
. // 43-5032      Dispatchers, Except Police, Fire, and Ambulance 1
. 
. replace oes_occ_code = "51-6091" if occ_lbl == "Textile, apparel, and furnish
> ings workers, all other 51-6099"
(18 real changes made)

. // 51-6091      Extruding and Forming Machine Setters, Operators, and Tenders
> , Synthetic and Glass Fibers       0
. // 51-6092      Fabric and Apparel Patternmakers        1
. // 51-6093      Upholsterers    0
. 
. replace oes_occ_code = "51-9121" if occ_lbl == "Painting workers 51-9120"
(187 real changes made)

. // 51-9121      Coating, Painting, and Spraying Machine Setters, Operators, a
> nd Tenders 0
. // 51-9122      Painters, Transportation Equipment      0
. // 51-9123      Painting, Coating, and Decorating Workers       1
. 
. merge m:1 oes_occ_code using `onet_temp'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        26,000
        from master                    25,683  (_merge==1)
        from using                        317  (_merge==2)

    Matched                           172,118  (_merge==3)
    -----------------------------------------

. 
. keep if _merge == 3
(26,000 observations deleted)

. drop _merge 

. 
. * Define 3 periods 
. gen pre_period  = inrange(date_monthly, tm(2016m1), tm(2019m12))

. gen inf_period  = inrange(date_monthly, tm(2021m4), tm(2023m5))

. gen post_period = inrange(date_monthly, tm(2023m6), tm(2024m12))

. 
. gen str10 period = ""
(172,118 missing values generated)

. replace period = "pre"  if pre_period == 1
(87,990 real changes made)

. replace period = "inf"  if inf_period == 1
(26,241 real changes made)

. replace period = "post" if post_period == 1
(20,157 real changes made)

. 
. save "$output_dir/figure_2_5_temp.dta", replace 
(file
    /Users/giyoung/Downloads/inflation_replication/scripts/master/data/proces
    > sed/figure_2_5_temp.dta not found)
file
    /Users/giyoung/Downloads/inflation_replication/scripts/master/data/proces
    > sed/figure_2_5_temp.dta saved

. 
. 
. 
end of do-file
